Revit 2024 API
HardwoodImperfectionsType Enumeration
 The enumerated type representing the permitted values for the asset property "HardwoodImperfections" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum HardwoodImperfectionsType
Visual Basic
Public Enumeration HardwoodImperfectionsType
Visual C++
public enum class HardwoodImperfectionsType
Members
Member name | Description
None
Automatic
Custom
See Also
Autodesk.Revit.DB.Visual Namespace